app/views/templates/_form.html.erb

    <%= f.label :account_id %><br />
    <%= f.collection_select(:account_id, Account.all, :id, :name) %>
---
SELECT "accounts".* FROM "accounts"