app/controllers/accounts_controller.rb

  def show
    @account = Account.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("admin_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["admin_id", 1], ["created_at", Wed, 26 Jun 2013 16:17:00 UTC +00:00], ["name", "Test Company"], ["updated_at", Wed, 26 Jun 2013 16:17:00 UTC +00:00]]