app/controllers/admins_controller.rb

  def show
    @admin = Admin.find(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @admin = Admin.new(params[:admin])

    respond_to do |format|
      if @admin.save
---
INSERT INTO "admins" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 26 Jun 2013 16:14:50 UTC +00:00], ["email", "tylerk@procore.com"], ["name", "Tyler Kresch"], ["updated_at", Wed, 26 Jun 2013 16:14:50 UTC +00:00]]

  def update
    @admin = Admin.find(params[:id])

    respond_to do |format|
      if @admin.update_attributes(params[:admin])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "admins" SET "first_name" = 'Tyler', "last_name" = 'Kresch', "updated_at" = '2013-06-26 18:01:24.780091' WHERE "admins"."id" = 1