app/controllers/tabs_controller.rb

  def index
    @tabs = Tab.all
---
SELECT "tabs".* FROM "tabs"

  def show
    @tab = Tab.find(params[:id])
---
SELECT "tabs".* FROM "tabs" WHERE "tabs"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @tab = Tab.new(tab_params)

    respond_to do |format|
      if @tab.save
---
INSERT INTO "tabs" ("admin_text", "created_at", "name", "note", "read_only_text", "standard_text", "updated_at", "workflow_text") VALUES (?, ?, ?, ?, ?, ?, ?, ?)