app/controllers/templates_controller.rb

  def index
    @templates = Template.all
---
SELECT "templates".* FROM "templates"

  def show
    @template = Template.find(params[:id])
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @account = Account.find(params[:account_id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "5"]]

  def edit
    @template = Template.find(params[:id])
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @account = Account.find(params[:template][:account_id])
    @templates = @account.templates
    @template = Template.new(params[:template])

    respond_to do |format|
      if @template.save
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "templates".* FROM "templates" WHERE "templates"."account_id" = 5
INSERT INTO "templates" ("account_id", "admin", "bidding", "change_orders", "commitments", "created_at", "daily_log", "directory", "documents", "drawings", "emails", "home", "meetings", "name", "photos", "prime_contract", "punch_list", "reports", "rfis", "schedule", "submittals", "transmittals", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @template = Template.find(params[:id])

    respond_to do |format|
      if @template.update_attributes(params[:template])
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "templates" SET "home" = 'Read Only', "emails" = 'Standard', "updated_at" = '2013-06-26 01:20:20.280545' WHERE "templates"."id" = 2

  def update_multiple
    @templates = Template.update(params[:templates].keys, params[:templates].values)
---
UPDATE "templates" SET "change_orders" = 'Read Only', "updated_at" = '2013-06-26 05:55:14.738467' WHERE "templates"."id" = 1