app/controllers/wizard_controller.rb

  def load_resources
    @account = Account.find(params[:account_id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "15"]]

  def start
    @account = Account.find(params[:account_id])
    if @account.templates.length < 3
---
SELECT "templates".* FROM "templates" WHERE "templates"."account_id" = 16