app/views/accounts/_form.html.erb

    <%= f.label :admin_id, "Account Manager" %><br />
    <%= f.collection_select(:admin_id, Admin.all, :id, :name, :prompt => 'Select')%>
---
SELECT "admins".* FROM "admins"